using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace Smart_Home
{
    // εδώ ορίζονται κάποια μηνύματα που εμφάνίζονται στον χρήστη, προκειμένου να βοηθηθεί και να 
    // χρησιμοποιεί με άνεση τον έξυπνο προσωπικό βοηθό ημέρας.
    public partial class Help : Form
    {
        public Help()
        {
            InitializeComponent();
        }

        // κουμπί βοήθειας "Επιλογή Έλεγχος Συσκευών"
        private void button13_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Πατώντας αυτή την επιλογή από το κύριο μενού θα μεταβείτε στο" +
                " χώρο όπου εσείς ελέγχετε απομακρυσμένα τις συσκευές του σπιτιού σας. Οι " +
                "συσκευές που υποστηρίζονται από τον προσωπικό βοηθό είναι: τα φώτα οροφής σε κάθε δωμάτιο, η θερμοκρασία (καλοριφέρ) κάθε δωματίου," +
                " η καφετιέρα που υπάρχει στην κουζίνα και η  παπουτσοθήκη που υπάρχει στο χωλ.");
        }

        // κουμπί 'Οnline βοήθεια'
        private void button11_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Το κουμπί αυτό σας οδηγεί στην οθόνη που βλέπετε μπροστά σας αυτή τη στιγμή. " +
                "Εδώ συλλέγεται όλη η πληροφορία που" +
                " σας καθοδηγεί για την ορθή λειτουργία του έξυπνου προσωπικού βοηθού ημέρας.");
        }

        // κουμπί βοήθειας Εισαγωγή προγράμματος
        private void button10_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Η επιλογή αυτή σας επιτρέπει να εισάγετε στον προσωπικό βοηθό σας το ημερήσιο πρόγραμμά σας. Από εκεί και" +
                " πέρα, η εφαρμογή αναλύει αυτό το πρόγραμμα και σας προτείνει συμβουλές όπως:" +
                " 1) σωστή επιλογή παπουτσιών ανάλογα την περίσταση και 2) οδηγίες για να κατευθυνθείτε" +
                " προς το σημείο που θέλετε να πάτε.");
        }

        // επιλογή βοήθειας "Άνοιγμα και Κλείσιμο φωτισμού οροφής"
        private void button5_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Το κουμπί 'Άνοιγμα φωτός', το οποίο δίνεται ως επιλογή για κάθε δωμάτιο του" +
                " σπιτιού σας, σας επιτρέπει να ενεργοποιήσετε και να απενεργοποιήσετε αντίστοιχα τον " +
                "φωτισμό στο εκάστοτε δωμάτιο. Την επιλογή αυτή θα την βρείτε πατώντας από το κύριο μενού " +
                "την επιλογή 'Έλεγχος Συσκευών'. Για να καταλάβετε εάν το φως στο δωμάτιο της" +
                " αρεσκείας σας έχει ανάψει ή σβήσει, η εικόνα του συγκεκριμένου δωματίου θα φαίνεται" +
                " ανοιχτόχρωμη ή σκουρόχρωμη αντίστοιχα. Ταυτόχρονα, μία λάμπα τοποθετημένη δίπλα από το κουμπί " +
                "'Άνοιγμα φωτός' ή το κουμπί 'Κλείσιμο φωτός' θα φαίνεται αναμμένη ή σβησμένη " +
                ", έτσι ώστε να καταλαβαίνετε γρήγορα και εύκολα την κατάσταση φωτισμού του δωματίου.");
        }

        // επιλογή βοήθειας 'φροντίδα κατοικιδίου'
        private void button12_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Η επιλογή αυτή βρίσκεται στο κύριο μενού του προσωπικού βοηθού." +
                " Πατώντας αυτό το κουμπί, μπορείτε να ελέγξετε κάθε ενέργεια που κάνει το" +
                " κατοικίδιό σας (ακόμα και όταν λείπετε από το σπίτι). Παράλληλα, με την δοθείσα" +
                " επιλογή, μπορείτε να ταϊσετε και να δώσετε νερό στο κατοικίδιό σας."); 
        }

        // επιλογή βοήθειας 'Άνοιγμα και Κλείσιμο θέρμανσης'
        private void button7_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Το κουμπί 'Άνοιγμα θέρμανσης', το οποίο δίνεται ως επιλογή για κάθε δωμάτιο του" +
                " σπιτιού σας, σας επιτρέπει να ενεργοποιήσετε και να απενεργοποιήσετε αντίστοιχα την " +
                "θέρμανση (καλοριφέρ) στο εκάστοτε δωμάτιο. Την επιλογή αυτή θα την βρείτε πατώντας από το κύριο μενού " +
                "την επιλογή 'Έλεγχος Συσκευών'. Για να καταλάβετε εάν η θέρμανση στο δωμάτιο της" +
                " αρεσκείας σας έχει ανάψει ή σβήσει, ένα θερμόμετρο΄δίπλα από το κουμπί 'Ανοιγμα θέρμανσης' ή 'Κλείσιμο θέρμανσης' θα φαίνεται κόκκινο " +
                "στην περίπτωση που η θέρμανση στο δωμάτιο έχει ενεργοποιηθεί και μπλε εάν η θέρμανση στο " +
                "συγκεκριμένο δωμάτιο έχει απενεργοποιηθεί.");
        }

        // επιλογή βοήθειας 'Άνοιγμα και Κλείσιμο καφετιέρας'
        private void button2_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Το κουμπί αυτό ελέγχει την κατάσταση λειτουργίας της καφετιέρας. Η επιλογή αυτή" +
                " δίνεται μόνο για το δωμάτιο της κουζίνας, καθώς εκεί βρίσκεται η συσκευή αυτή. Με την επιλογή" +
                " αυτή, μπορείτε να θέτετε απομακρυσμένα την καφετιέρα σε κατάσταση λειτουργίας ή απενεργοποίησης.");
        }

        // επιλογή βοήθειας 'Ρύθμιση θερμοκρασίας'
        private void button1_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Στην περίπτωση που θέλετε να ρυθμίσετε εσείς την θερμοκρασία που" +
                " θα εκπέμπεται από το καλοριφέρ σε ένα δωμάτιο της αρεσκείας σας, μπορείτε να" +
                " μεταβείτε στην επιλογή 'Περισσότερες Ρυθμίσεις' που υπάρχει στο συγκεκριμένο δωμάτιο." +
                " Έπειτα, μπορείτε να θέσετε την θερμοκρασία του συγκεκριμένου δωματίου σε Χαμηλή, Μέτρια ή" +
                " Υψηλή. Τέλος, επικυρώνετε την επιλογή σας πατώντας το κουμπί 'ΟΚ' που υπάρχει δίπλα. Σημείωση:" +
                " η θερμοκρασία δεν μπορεί να οριστεί όταν η θέρμανση του συγκεκριμένου δωματίου είναι απενεργοποιημένη!");
        }

        // κουμπί βοήθειας "Πως να παράξετε καφέ"
        private void button4_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Για την παραγωγή καφέ μεταβείτε στην επιλογή 'Περισσότερες Ρυθμίσεις' του δωματίου" +
                " της κουζίνας. Έπειτα, πατήστε το κουμπί 'Παρασκευή Καφέ'. Η καφετιέρα σας θα ξεκινήσει να φτιάχνει" +
                " καφέ. Σημείωση: Η παρασκευή καφέ είναι άδύνατη στην περίπτωση που η καφετιέρα είναι απενεργοποιημένη!");
        }

        // κουμπί βοήθειας "Αυτοκαθαρισμός Καφετιέρας"
        private void button14_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Η καφετιέρα μπορεί να αυτοκαθαρίζεται. Για να κάνετε καθαριμό της καφετιέρας σας" +
                " μεταβείτε στην επιλογή 'Περισσότερες Ρυθμίσεις' του δωματίου" +
                " της κουζίνας. Έπειτα, πατήστε το κουμπί 'Αυτοκαθαρισμός Καφετιέρας'. Η καφετιέρα σας θα ξεκινήσει να αυτοκαθαρίζεται." +
                " Σημείωση: Ο αυτοκαθαρισμός της καφετιέρας δεν πραγματοποιείται στην περίπτωση που αυτή είναι απενεργοποιημένη!");
        }

        // κουμπί βοήθειας "άνοιγμα και κλείσιμο παπουτσοθήκης"
        private void button6_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Για να ενεργοποιήσετε ή να απενεργοποιήσετε την παπουτσοθήκη, η οποία βρίσκεται" +
                " στο χωλ του σπιτιού, μεταβείτε στο μενού 'Έλεγχος Συσκευών'. Έπειτα πηγαινετε στο δωμάτιο του" +
                " χωλ και πατήστε το κουμπί 'Άνοιγμα Παπουτσοθήκης' ή 'Κλείσιμο Παπουτσοθήκης' αντίστοιχα.");
        }

        // κουμπί βοήθειας "Πώς λειτουργεί η παπουτσοθήκη;"
        private void button3_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Η έξυπνη παπουτσοθήκη που βρίσκεται στο χωλ του σπιτιού σας συνδέεται" +
                " με μία αντλία νερού. Με αυτόν τον τρόπο, τα όποια παπούτσια βρίσκονται αποθηκευμένα" +
                " εντός της παπουτσοθήκης μπορούν να πλύνονται (εφόσον το θέλετε). Ταυτόχρονα, η παπουτσοθήκη" +
                " διαθέτει λειτουργεία για αυτόματο αυτοκαθαρισμό.");
        }

        // κουμπί βοήθειας "Πλύσιμο παπουτσιών στην παπουτσοθήκη"
        private void button8_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Η παπουτσοθήκη προσφέρει προαιρετικά την λειτουργία για πλύσιμο των παπουτσιών" +
                " που βρίσκονται αποθηκευμένα εντός της. Για να εκτελέσετε αυτή την ενέργεια, μεταβείτε στο" +
                " μενού 'Έλεγχος Συσκευών'. Στην συνέχεια, πηγαίνετε στο δωμάτιο 'Χωλ' και πατήστε 'Περισσότερες" +
                " Ρυθμίσεις'. Εκεί θα βρείτε το κουμπί 'Πλύσιμο Παπουτσιών'. Τότε, η ζητούμενη ενέργεια πραγματοποιείται!" +
                " Σημείωση: η συγκεκριμένη ενέργεια γίνεται μόνο εφόσον η παπυτσοθήκη βρίσκεται σε λειτουργία!");
        }

        // κουμπί βοήθειας "Αυτοκαθαρισμός Παπουτσοθήκης"
        private void button9_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Η παπουτσοθήκη προσφέρει προαιρετικά την λειτουργία για αυτόματο αυτοκαθαρισμό αυτής." +
                " Για να εκτελέσετε αυτή την ενέργεια, μεταβείτε στο" +
                " μενού 'Έλεγχος Συσκευών'. Στην συνέχεια, πηγαίνετε στο δωμάτιο 'Χωλ' και πατήστε 'Περισσότερες" +
                " Ρυθμίσεις'. Εκεί θα βρείτε το κουμπί 'Αυτοκαθαρισμός Παπουτσοθήκης'. Τότε, η ζητούμενη ενέργεια πραγματοποιείται!" +
                " Σημείωση: η συγκεκριμένη ενέργεια γίνεται μόνον εφόσο η παπυτσοθήκη βρίσκεται σε λειτουργία!");
        }

        // κουμπί "Πώς μπορώ να εισάγω το πρόγραμμά μου;"
        private void button15_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Για να εισάγετε το πρόγραμμα ημέρας πατήστε την επιλογή 'Εισαγωγή Προγράμματος'" +
                " από το κεντρικό μενού. Στη συνέχεια, στο παράθυρο που ανοίγεται επιλέγετε για κάθε ώρα της ημέρας" +
                " που εμφανίζεται (από τις 9 το πρωϊ έως και τις 11 το βράδυ) μία από τις διαθέσιμες επιλογές που εμφανίζονται." +
                " Δεν είναι ανάγκη να συμπληρώσετε στο πρόγραμμα ημέρας σας όλες τις ώρες. Τέλος, για την αποθήκευση των αλλαγών" +
                " σας, πατήστε το κουμπί 'Αποθήκευση'. Το πρόγραμμα ημέρας σας έχει καταχωρηθεί πλέον με επιτυχία!");
        }

        // κουμπί "Διαγραφή του προγράμματος ημέρας"
        private void button16_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Σε περίπτωση που έχετε κάνει λάθος στο πρόγραμμα ημέρας σας ή θέλετε να τροποποιήσετε το πρόγραμμα ημέρας σας" +
                " , πατήστε το κουμπί 'Διαγραφή όλων'. Με αυτόν τον τρόπο, όλες οι καταχωρήσεις στο πρόγραμμα ημέρας σβήνονται και εσείς θα πρέπει να" +
                " εισάγετε εκ νέου το πρόγραμμα ημέρας σας!");
        }

        // κουμπί "Πώς ο βοηθός ξέρει τί παπούτσια χρειάζομαι;"
        private void button18_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Ο έξυπνος βοηθός είναι σε θέση να σας πει ποια είναι τα κατάλληλα παπούτσια που χρειάζεστε" +
                " ανάλογα με το πρόγραμμα ημέρας που έχετε ήδη καταχωρήσει. Ο έξυπνος βοηθός, αφού γίνει η εισαγωγή του" +
                " προγράμματος από εσάς, αναλύει το πρόγραμμα ημέρας σας και σας προτείνει να αγοράσετε παπούτσια που εσείς" +
                " δεν έχετε στην κατοχή σας, αλλά είναι απαραίτητα για την εκπλήρωση του προγράμματος ημέρας σας. Σε περίπτωση που " +
                " έχετε όλα τα παπούτσια που χρειάζονται στην παπουτσοθήκη σας, ο έξυπνος βοηθός σας απαντάει με κατάλληλο μήνυμα.");
        }

        // κουμπί "Πώς γίνεται η αγορά παπουτσιών;"
        private void button17_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Εφόσον έχετε συμπληρώσει και αποθηκεύσει το πρόγραμμα ημέρας σας, ο έξυπνος βοηθός" +
                " στο κομμάτι του παραθύρου 'Αγορά νέων παπουτσιών' σας προτείνει παπούτσια που χρειάζεται να αγοράσετε." +
                " Δίπλα από κάθε είδος παπουτσιού, υπάρχει ένα αντίστοιχο κουμπί 'Αγορά', το οποίο πατάτε για να αγοράσετε" +
                " το συγκεκριμένο ζευγάρι παπουτσιών.");
        }

        // κουμπί "Οδηγίες τοποθεσίας μέσω του βοηθού"
        private void button21_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Ο έξυπνος βοηθός είναι σε θέση να σας προτείνει αναλυτικές οδηγίες για δραστηριότητες" +
                " που έχετε καταχωρήσει στο πρόγραμμά σας και οι οποίες βρίσκονται εκτός σπιτιού. Σε περίπτωση που" +
                " υπάρχουν τέτοιες δραστηριότητες καταχωρημένες στο πρόγραμμα ημέρας σας, στο κομμάτι ΄Γεωγραφικές οδηγίες'" +
                " του παραθύρου δίνονται γεωγραφικές οδηγίες, ανάλογα την δραστηριότητα που εσείς θέλετε να μάθετε για το πως" +
                " να πάτε σε αυτή. Εσείς επιλέγετε για ποια δραστηριότητα θέλετε να μάθετε γεωγραφικές οδηγίες. Στην συνέχεια, " +
                "εμφανίζεται ένας χάρτης με τις οδηγίες, όπως και η επιλογή 'Άνοιγμα τοποθεσίας στο Google Maps', σε περίπτωση" +
                " που θέλετε αναλυτικότερες οδηγίες.");
        }

        // κουμπί "Παραγγελία καφέ με ένα πάτημα"
        private void button20_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Εφόσον προβλέπονται δραστηριότητες εκτός σπιτιού, ο έξυπνος βοηθός σας δίνει την " +
                "επιλογή να κάνετε παραγγελία καφέ από ένα κατάστημα που βρίσκεται πάνω στην διαδρομή σας. Για να κάνετε" +
                " παραγγελία καφέ, πατήστε το κουμπί 'Παραγγελία καφέ', το οποίο βρίσκεται στο κομμάτι του παραθύρου 'Γεωγραφικές οδηγίες'.");
        }
    }
}
