using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace Smart_Home
{
    // εδώ ορίζονται κάποια μηνύματα που εμφάνίζονται στον χρήστη, προκειμένου να βοηθηθεί και να 
    // χρησιμοποιεί με άνεση τον έξυπνο προσωπικό βοηθό ημέρας.
    public partial class Help : Form
    {
        public Help()
        {
            InitializeComponent();
        }

        // κουμπί βοήθειας "Επιλογή Έλεγχος Συσκευών"
        private void button13_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Πατώντας αυτή την επιλογή από το κύριο μενού θα μεταβείτε στο" +
                " χώρο όπου εσείς ελέγχετε απομακρυσμένα τις συσκευές του σπιτιού σας.\n\nΟι " +
                "συσκευές που υποστηρίζονται από τον προσωπικό βοηθό είναι: τα φώτα οροφής σε κάθε δωμάτιο, η θερμοκρασία (καλοριφέρ) κάθε δωματίου," +
                " η καφετιέρα που υπάρχει στην κουζίνα και η  παπουτσοθήκη που υπάρχει στο χωλ.", "Έλεγχος Συσκευών", MessageBoxButtons.OK, MessageBoxIcon.Question);
        }

        // κουμπί 'Οnline βοήθεια'
        private void button11_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Το κουμπί αυτό σας οδηγεί στην οθόνη που βλέπετε μπροστά σας αυτή τη στιγμή.\n\n" +
                "Εδώ συλλέγεται όλη η πληροφορία που" +
                " σας καθοδηγεί για την ορθή λειτουργία του έξυπνου προσωπικού βοηθού ημέρας.", "Online Βοήθεια", MessageBoxButtons.OK, MessageBoxIcon.Question);
        }

        // κουμπί βοήθειας Εισαγωγή προγράμματος
        private void button10_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Η επιλογή αυτή σας επιτρέπει να εισάγετε στον προσωπικό βοηθό σας το ημερήσιο πρόγραμμά σας.Από εκεί και" +
                " πέρα, η εφαρμογή αναλύει αυτό το πρόγραμμα και σας προτείνει συμβουλές όπως:\n\n" +
                " 1) σωστή επιλογή παπουτσιών ανάλογα την περίσταση και\n 2) οδηγίες για να κατευθυνθείτε" +
                " προς το σημείο που θέλετε να πάτε.", "Εισαγωγή Προγράμματος", MessageBoxButtons.OK, MessageBoxIcon.Question);
        }

        // επιλογή βοήθειας "Άνοιγμα και Κλείσιμο φωτισμού οροφής"
        private void button5_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Το κουμπί 'Άνοιγμα φωτός', το οποίο δίνεται ως επιλογή για κάθε δωμάτιο του" +
                " σπιτιού σας, σας επιτρέπει να ενεργοποιήσετε και να απενεργοποιήσετε αντίστοιχα τον " +
                "φωτισμό στο εκάστοτε δωμάτιο.\n\nΤην επιλογή αυτή θα την βρείτε πατώντας από το κύριο μενού " +
                "την επιλογή 'Έλεγχος Συσκευών'.\n\n Για να καταλάβετε εάν το φως στο δωμάτιο της" +
                " αρεσκείας σας έχει ανάψει ή σβήσει, η εικόνα του συγκεκριμένου δωματίου θα φαίνεται" +
                " ανοιχτόχρωμη ή σκουρόχρωμη αντίστοιχα. Ταυτόχρονα, μία λάμπα τοποθετημένη δίπλα από το κουμπί " +
                "'Άνοιγμα φωτός' ή το κουμπί 'Κλείσιμο φωτός' θα φαίνεται αναμμένη ή σβησμένη " +
                ", έτσι ώστε να καταλαβαίνετε γρήγορα και εύκολα την κατάσταση φωτισμού του δωματίου.", "Άνοιγμα και Κλείσιμο φωτισμού οροφής", MessageBoxButtons.OK, MessageBoxIcon.Question);
        }

        // επιλογή βοήθειας 'φροντίδα κατοικιδίου'
        private void button12_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Η επιλογή αυτή βρίσκεται στο κύριο μενού του προσωπικού βοηθού.\n\n" +
                " Πατώντας αυτό το κουμπί, μπορείτε να ελέγξετε κάθε ενέργεια που κάνει το" +
                " κατοικίδιό σας (ακόμα και όταν λείπετε από το σπίτι). \n\nΠαράλληλα, με την δοθείσα" +
                " επιλογή, μπορείτε να ταϊσετε και να δώσετε νερό στο κατοικίδιό σας.", "Φροντίδα Κατοικιδίου", MessageBoxButtons.OK, MessageBoxIcon.Question); 
        }

        // επιλογή βοήθειας 'Άνοιγμα και Κλείσιμο θέρμανσης'
        private void button7_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Το κουμπί 'Άνοιγμα θέρμανσης', το οποίο δίνεται ως επιλογή για κάθε δωμάτιο του" +
                " σπιτιού σας, σας επιτρέπει να ενεργοποιήσετε και να απενεργοποιήσετε αντίστοιχα την " +
                "θέρμανση (καλοριφέρ) στο εκάστοτε δωμάτιο.\n\n Την επιλογή αυτή θα την βρείτε πατώντας από το κύριο μενού " +
                "την επιλογή 'Έλεγχος Συσκευών'.\n\nΓια να καταλάβετε εάν η θέρμανση στο δωμάτιο της" +
                " αρεσκείας σας έχει ανάψει ή σβήσει, ένα θερμόμετρο΄δίπλα από το κουμπί 'Ανοιγμα θέρμανσης' ή 'Κλείσιμο θέρμανσης' θα φαίνεται κόκκινο " +
                "στην περίπτωση που η θέρμανση στο δωμάτιο έχει ενεργοποιηθεί και μπλε εάν η θέρμανση στο " +
                "συγκεκριμένο δωμάτιο έχει απενεργοποιηθεί.", "Άνοιγμα και Κλείσιμο θέρμανσης", MessageBoxButtons.OK, MessageBoxIcon.Question);
        }

        // επιλογή βοήθειας 'Άνοιγμα και Κλείσιμο καφετιέρας'
        private void button2_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Το κουμπί αυτό ελέγχει την κατάσταση λειτουργίας της καφετιέρας.\n\nΗ επιλογή αυτή" +
                " δίνεται μόνο για το δωμάτιο της κουζίνας, καθώς εκεί βρίσκεται η συσκευή αυτή. Με την επιλογή" +
                " αυτή, μπορείτε να θέτετε απομακρυσμένα την καφετιέρα σε κατάσταση λειτουργίας ή απενεργοποίησης.", "Άνοιγμα και Κλείσιμο καφετιέρας", MessageBoxButtons.OK, MessageBoxIcon.Question);
        }

        // επιλογή βοήθειας 'Ρύθμιση θερμοκρασίας'
        private void button1_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Στην περίπτωση που θέλετε να ρυθμίσετε εσείς την θερμοκρασία που" +
                " θα εκπέμπεται από το καλοριφέρ σε ένα δωμάτιο της αρεσκείας σας, μπορείτε να" +
                " μεταβείτε στην επιλογή 'Περισσότερες Ρυθμίσεις' που υπάρχει στο συγκεκριμένο δωμάτιο.\n\n" +
                " Έπειτα, μπορείτε να θέσετε την θερμοκρασία του συγκεκριμένου δωματίου σε Χαμηλή, Μέτρια ή" +
                " Υψηλή.\n\n Τέλος, επικυρώνετε την επιλογή σας πατώντας το κουμπί 'ΟΚ' που υπάρχει δίπλα. Σημείωση:" +
                " η θερμοκρασία δεν μπορεί να οριστεί όταν η θέρμανση του συγκεκριμένου δωματίου είναι απενεργοποιημένη!", "Ρύθμιση θερμοκρασίας", MessageBoxButtons.OK, MessageBoxIcon.Question);
        }

        // κουμπί βοήθειας "Πως να παράξετε καφέ"
        private void button4_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Για την παραγωγή καφέ μεταβείτε στην επιλογή 'Περισσότερες Ρυθμίσεις' του δωματίου" +
                " της κουζίνας. Έπειτα, πατήστε το κουμπί 'Παρασκευή Καφέ'.\n\n Η καφετιέρα σας θα ξεκινήσει να φτιάχνει" +
                " καφέ. Σημείωση: Η παρασκευή καφέ είναι άδύνατη στην περίπτωση που η καφετιέρα είναι απενεργοποιημένη!", "Πως να παράξετε καφέ", MessageBoxButtons.OK, MessageBoxIcon.Question);
        }

        // κουμπί βοήθειας "Αυτοκαθαρισμός Καφετιέρας"
        private void button14_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Η καφετιέρα μπορεί να αυτοκαθαρίζεται. Για να κάνετε καθαριμό της καφετιέρας σας" +
                " μεταβείτε στην επιλογή 'Περισσότερες Ρυθμίσεις' του δωματίου" +
                " της κουζίνας.\n\n Έπειτα, πατήστε το κουμπί 'Αυτοκαθαρισμός Καφετιέρας'. Η καφετιέρα σας θα ξεκινήσει να αυτοκαθαρίζεται." +
                " Σημείωση: Ο αυτοκαθαρισμός της καφετιέρας δεν πραγματοποιείται στην περίπτωση που αυτή είναι απενεργοποιημένη!", "Αυτοκαθαρισμός Καφετιέρας", MessageBoxButtons.OK, MessageBoxIcon.Question);
        }

        // κουμπί βοήθειας "άνοιγμα και κλείσιμο παπουτσοθήκης"
        private void button6_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Για να ενεργοποιήσετε ή να απενεργοποιήσετε την παπουτσοθήκη, η οποία βρίσκεται" +
                " στο χωλ του σπιτιού, μεταβείτε στο μενού 'Έλεγχος Συσκευών'.\n\n Έπειτα πηγαινετε στο δωμάτιο του" +
                " χωλ και πατήστε το κουμπί 'Άνοιγμα Παπουτσοθήκης' ή 'Κλείσιμο Παπουτσοθήκης' αντίστοιχα.", "Άνοιγμα και Κλείσιμο Παπουτσοθήκης", MessageBoxButtons.OK, MessageBoxIcon.Question);
        }

        // κουμπί βοήθειας "Πώς λειτουργεί η παπουτσοθήκη;"
        private void button3_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Η έξυπνη παπουτσοθήκη που βρίσκεται στο χωλ του σπιτιού σας συνδέεται" +
                " με μία αντλία νερού. Με αυτόν τον τρόπο, τα όποια παπούτσια βρίσκονται αποθηκευμένα" +
                " εντός της παπουτσοθήκης μπορούν να πλύνονται (εφόσον το θέλετε).\n\n Ταυτόχρονα, η παπουτσοθήκη" +
                " διαθέτει λειτουργεία για αυτόματο αυτοκαθαρισμό.", "Πώς λειτουργεί η παπουτσοθήκη;", MessageBoxButtons.OK, MessageBoxIcon.Question);
        }

        // κουμπί βοήθειας "Πλύσιμο παπουτσιών στην παπουτσοθήκη"
        private void button8_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Η παπουτσοθήκη προσφέρει προαιρετικά την λειτουργία για πλύσιμο των παπουτσιών" +
                " που βρίσκονται αποθηκευμένα εντός της.\n\n Για να εκτελέσετε αυτή την ενέργεια, μεταβείτε στο" +
                " μενού 'Έλεγχος Συσκευών'. Στην συνέχεια, πηγαίνετε στο δωμάτιο 'Χωλ' και πατήστε 'Περισσότερες" +
                " Ρυθμίσεις'. Εκεί θα βρείτε το κουμπί 'Πλύσιμο Παπουτσιών'. Τότε, η ζητούμενη ενέργεια πραγματοποιείται!\n\n" +
                " Σημείωση: η συγκεκριμένη ενέργεια γίνεται μόνο εφόσον η παπυτσοθήκη βρίσκεται σε λειτουργία!", "Πλύσιμο παπουτσιών στην παπουτσοθήκη", MessageBoxButtons.OK, MessageBoxIcon.Question);
        }

        // κουμπί βοήθειας "Αυτοκαθαρισμός Παπουτσοθήκης"
        private void button9_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Η παπουτσοθήκη προσφέρει προαιρετικά την λειτουργία για αυτόματο αυτοκαθαρισμό αυτής.\n\n" +
                " Για να εκτελέσετε αυτή την ενέργεια, μεταβείτε στο" +
                " μενού 'Έλεγχος Συσκευών'. Στην συνέχεια, πηγαίνετε στο δωμάτιο 'Χωλ' και πατήστε 'Περισσότερες" +
                " Ρυθμίσεις'. Εκεί θα βρείτε το κουμπί 'Αυτοκαθαρισμός Παπουτσοθήκης'. Τότε, η ζητούμενη ενέργεια πραγματοποιείται!\n\n" +
                " Σημείωση: η συγκεκριμένη ενέργεια γίνεται μόνον εφόσο η παπυτσοθήκη βρίσκεται σε λειτουργία!", "Αυτοκαθαρισμός Παπουτσοθήκης", MessageBoxButtons.OK, MessageBoxIcon.Question);
        }

        // κουμπί "Πώς μπορώ να εισάγω το πρόγραμμά μου;"
        private void button15_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Για να εισάγετε το πρόγραμμα ημέρας πατήστε την επιλογή 'Εισαγωγή Προγράμματος'" +
                " από το κεντρικό μενού. Στη συνέχεια, στο παράθυρο που ανοίγεται επιλέγετε για κάθε ώρα της ημέρας" +
                " που εμφανίζεται (από τις 9 το πρωϊ έως και τις 11 το βράδυ) μία από τις διαθέσιμες επιλογές που εμφανίζονται.\n\n" +
                " Δεν είναι ανάγκη να συμπληρώσετε στο πρόγραμμα ημέρας σας όλες τις ώρες. Τέλος, για την αποθήκευση των αλλαγών" +
                " σας, πατήστε το κουμπί 'Αποθήκευση'.\n\n Το πρόγραμμα ημέρας σας έχει καταχωρηθεί πλέον με επιτυχία!", "Πώς μπορώ να εισάγω το πρόγραμμά μου;", MessageBoxButtons.OK, MessageBoxIcon.Question);
        }

        // κουμπί "Διαγραφή του προγράμματος ημέρας"
        private void button16_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Σε περίπτωση που έχετε κάνει λάθος στο πρόγραμμα ημέρας σας ή θέλετε να τροποποιήσετε το πρόγραμμα ημέρας σας" +
                " , πατήστε το κουμπί 'Διαγραφή όλων'. Με αυτόν τον τρόπο, όλες οι καταχωρήσεις στο πρόγραμμα ημέρας σβήνονται και εσείς θα πρέπει να" +
                " εισάγετε εκ νέου το πρόγραμμα ημέρας σας!", "Διαγραφή του προγράμματος ημέρας", MessageBoxButtons.OK, MessageBoxIcon.Question);
        }

        // κουμπί "Πώς ο βοηθός ξέρει τί παπούτσια χρειάζομαι;"
        private void button18_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Ο έξυπνος βοηθός είναι σε θέση να σας πει ποια είναι τα κατάλληλα παπούτσια που χρειάζεστε" +
                " ανάλογα με το πρόγραμμα ημέρας που έχετε ήδη καταχωρήσει.\n\n Ο έξυπνος βοηθός, αφού γίνει η εισαγωγή του" +
                " προγράμματος από εσάς, αναλύει το πρόγραμμα ημέρας σας και σας προτείνει να αγοράσετε παπούτσια που εσείς" +
                " δεν έχετε στην κατοχή σας, αλλά είναι απαραίτητα για την εκπλήρωση του προγράμματος ημέρας σας.\n\n Σε περίπτωση που " +
                " έχετε όλα τα παπούτσια που χρειάζονται στην παπουτσοθήκη σας, ο έξυπνος βοηθός σας απαντάει με κατάλληλο μήνυμα.", "Πώς ο βοηθός ξέρει τί παπούτσια χρειάζομαι;", MessageBoxButtons.OK, MessageBoxIcon.Question);
        }

        // κουμπί "Πώς γίνεται η αγορά παπουτσιών;"
        private void button17_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Εφόσον έχετε συμπληρώσει και αποθηκεύσει το πρόγραμμα ημέρας σας, ο έξυπνος βοηθός" +
                " στο κομμάτι του παραθύρου 'Αγορά νέων παπουτσιών' σας προτείνει παπούτσια που χρειάζεται να αγοράσετε.\n\n" +
                " Δίπλα από κάθε είδος παπουτσιού, υπάρχει ένα αντίστοιχο κουμπί 'Αγορά', το οποίο πατάτε για να αγοράσετε" +
                " το συγκεκριμένο ζευγάρι παπουτσιών.", "Πώς γίνεται η αγορά παπουτσιών;", MessageBoxButtons.OK, MessageBoxIcon.Question);
        }

        // κουμπί "Οδηγίες τοποθεσίας μέσω του βοηθού"
        private void button21_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Ο έξυπνος βοηθός είναι σε θέση να σας προτείνει αναλυτικές οδηγίες για δραστηριότητες" +
                " που έχετε καταχωρήσει στο πρόγραμμά σας και οι οποίες βρίσκονται εκτός σπιτιού.\n\n Σε περίπτωση που" +
                " υπάρχουν τέτοιες δραστηριότητες καταχωρημένες στο πρόγραμμα ημέρας σας, στο κομμάτι ΄Γεωγραφικές οδηγίες'" +
                " του παραθύρου δίνονται γεωγραφικές οδηγίες, ανάλογα την δραστηριότητα που εσείς θέλετε να μάθετε για το πως" +
                " να πάτε σε αυτή. Εσείς επιλέγετε για ποια δραστηριότητα θέλετε να μάθετε γεωγραφικές οδηγίες.\n\n Στην συνέχεια, " +
                "εμφανίζεται ένας χάρτης με τις οδηγίες, όπως και η επιλογή 'Άνοιγμα τοποθεσίας στο Google Maps', σε περίπτωση" +
                " που θέλετε αναλυτικότερες οδηγίες.", "Οδηγίες τοποθεσίας μέσω του βοηθού", MessageBoxButtons.OK, MessageBoxIcon.Question);
        }

        // κουμπί "Παραγγελία καφέ με ένα πάτημα"
        private void button20_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Εφόσον προβλέπονται δραστηριότητες εκτός σπιτιού, ο έξυπνος βοηθός σας δίνει την " +
                "επιλογή να κάνετε παραγγελία καφέ από ένα κατάστημα που βρίσκεται πάνω στην διαδρομή σας.\n\n Για να κάνετε" +
                " παραγγελία καφέ, πατήστε το κουμπί 'Παραγγελία καφέ', το οποίο βρίσκεται στο κομμάτι του παραθύρου 'Γεωγραφικές οδηγίες'.", "Παραγγελία καφέ με ένα πάτημα", MessageBoxButtons.OK, MessageBoxIcon.Question);
        }

        private void button19_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Μπορείτε να δείτε τα κατοικίδιά σας στην καρτέλα της «ΦΡΟΝΤΙΔΑΣ ΚΑΤΟΙΚΙΔΙΟΥ». Μέσα σε αυτήν, διαχειρίζεστε τις " +
                "ανάγκες των κατοικιδίων σας, έχοντας έλεγχο για τα μπωλ με το φαΐ και το νερό, αλλά και για την επισκευή των εύθραυστων επίπλων.\n\n" +
                "Κάτω από τις εικόνες των μπωλ, μπορείτε να δείτε και την ποσότητα που έχει. Αν η ποσότητα πάει κάτω από 30% θα σας έρθει ανάλογη ειδοποίηση στον έξυπνο βοηθό.", "Γενικά για τα ζώα", MessageBoxButtons.OK, MessageBoxIcon.Question);
        }

        private void button22_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Έχοντας ΑΝΟΙΧΤΗ την Αυτόματη Ταΐστρα, μπορείτε άφοβα να αφήσετε την δουλειά της επαναφοράς των μπωλ, καθώς αυτή γίνεται αυτόματα." +
                " Η αυτόματη ταΐστρα θα προσθέσει ποσότητα φαγητού/νερού, όταν διαπιστωθεί ότι αυτή πάει κάτω από 30%.\n\n" +
                "Οποιαδήποτε στιγμή το θελήσετε, μπορείτε να γεμίσετε όλα τα μπωλ, πατώντας το κουμπί «ΓΕΜΙΣΜΑ ΟΛΩΝ ΤΩΝ ΜΠΩΛ». Το κουμπί αυτό, ανεξάρτητα από το αν " +
                "έχουμε θέσει σε λειτουργία την αυτόματη ταΐστρα, θα γεμίσει στην μέγιστη ποσότητα όλα τα μπωλ φαγητού και νερού.", "Αυτόματη Ταΐστρα και Γέμισμα των Μπωλ", MessageBoxButtons.OK, MessageBoxIcon.Question);
        }

        private void button23_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Το σύστημα, προσπαθεί αυτόματα να ανιχνεύσει εύθραυστα αντικείμενα στο σπίτι. Μερικά από αυτά μπορούν να επισκευασθούν αυτόματα από τον έξυπνο βοηθό." +
                " Μόλις διαπιστωθεί ότι κάποιο αντικείμενο έχει σπάσει, το οποίο ο έξυπνος βοηθός μπορεί να τακτοποιήσει, εμφανίζεται μήνυμα κάτω από την «ΦΡΟΝΤΙΔΑ ΚΑΤΟΙΚΙΔΙΟΥ» ένα ανάλογο" +
                " μήνυμα για την επισκευή του. Η επισκευή γίνεται με το πάτημα του κουμπιού «ΕΠΙΣΚΕΥΗ ΕΥΘΡΑΥΣΤΩΝ ΑΝΤΙΚΕΙΜΕΝΩΝ»." +
                "\n\nΣΗΜΑΝΤΙΚΗ ΣΗΜΕΙΩΣΗ: Ο έξυπνος βοηθός μπορεί να επισκευάσει ΜΟΝΟΝ σκισμένες κουρτίνες, σπασμένα βάζα, σπασμένα πιάτα, σπασμένα ποτήρια και" +
                " ξεθωριασμένο καναπέ. Οποιεσδήποτε άλλες βλάβες είναι «τυφλές» στο σύστημα.", "Εύθραυστα Αντικείμενα", MessageBoxButtons.OK, MessageBoxIcon.Question);
        }
    }
}
